src/cf/src/InformationRegisters/ПравилаЦенообразования/ПравилаЦенообразования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаЦенообразования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </resources>
  <resources>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </resources>
  <resources>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>DefinedType.ПараметрЦенообразования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НадбавкиНаСебестоимость/НадбавкиНаСебестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НадбавкиНаСебестоимость</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Процент</name>
    <type>
      <types>DefinedType.Процент</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыНаценок/ВидыНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаценок</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/InformationRegisters/ПравилаЦенообразования/ManagerModule.bsl
Процедура ПолучитьАктуальные(МВТ, ДатаСреза, МасНоменклатура = Неопределено) Экспорт
	Если МасНоменклатура = Неопределено Тогда
		МасНоменклатура = Новый Массив;	
	КонецЕсли;	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПравилаЦенообразованияСрезПоследних.Период КАК Период,
	                      |	ПравилаЦенообразованияСрезПоследних.Параметр КАК Параметр,
	                      |	ВЫБОР
	                      |		КОГДА ТИПЗНАЧЕНИЯ(ПравилаЦенообразованияСрезПоследних.Параметр) = ТИП(Справочник.Номенклатура)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Порядок,
	                      |	ПравилаЦенообразованияСрезПоследних.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ПравилаЦенообразованияСрезПоследних.ВидНаценки КАК ВидНаценки,
	                      |	ПравилаЦенообразованияСрезПоследних.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрСведений.ПравилаЦенообразования.СрезПоследних(&ДатаСреза, ) КАК ПравилаЦенообразованияСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Период КАК Период,
	                      |	ВТ.Параметр КАК Параметр,
	                      |	ВТ.Порядок КАК Порядок,
	                      |	ВТ.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТ.ВидНаценки КАК ВидНаценки,
	                      |	ВТ.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравила
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		МАКСИМУМ(ВТ.Период) КАК Период
	                      |	ИЗ
	                      |		ВТ КАК ВТ) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	                      |		ПО ВЗ.Период = ВТ.Период
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	                      |	ВТПравила.Порядок КАК Порядок,
	                      |	ВТПравила.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТПравила.ВидНаценки КАК ВидНаценки,
	                      |	ВТПравила.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравилаПредварительные
	                      |ИЗ
	                      |	ВТПравила КАК ВТПравила
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |		ПО (ВЫБОР
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.Номенклатура)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.Ссылка
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.ТоварныеГруппы)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.ТоварнаяГруппа
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА &НоменклатураУстановлена
	                      |					ТОГДА Номенклатура.Ссылка В (&МасНоменклатура)
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Номенклатура.Ссылка,
	                      |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	                      |	ВТПравила.Порядок,
	                      |	ВТПравила.ОсноваРасчёта,
	                      |	ВТПравила.ВидНаценки,
	                      |	ВТПравила.Показатель
	                      |ИЗ
	                      |	ВТПравила КАК ВТПравила
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |			ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	                      |		ПО (ВЫБОР
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.Номенклатура)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.Ссылка
	                      |				КОГДА ТИПЗНАЧЕНИЯ(ВТПравила.Параметр) = ТИП(Справочник.ТоварныеГруппы)
	                      |					ТОГДА ВТПравила.Параметр = Номенклатура.ТоварнаяГруппа
	                      |			КОНЕЦ)
	                      |			И (ВЫБОР
	                      |				КОГДА &НоменклатураУстановлена
	                      |					ТОГДА Номенклатура.Ссылка В (&МасНоменклатура)
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТПравилаПредварительные.Номенклатура КАК Номенклатура,
	                      |	ВТПравилаПредварительные.Характеристика КАК Характеристика,
	                      |	ВТПравилаПредварительные.ОсноваРасчёта КАК ОсноваРасчёта,
	                      |	ВТПравилаПредварительные.ВидНаценки КАК ВидНаценки,
	                      |	ВТПравилаПредварительные.Показатель КАК Показатель
	                      |ПОМЕСТИТЬ ВТПравилаЦенообразования
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТПравилаПредварительные.Номенклатура КАК Номенклатура,
	                      |		ВТПравилаПредварительные.Характеристика КАК Характеристика,
	                      |		МИНИМУМ(ВТПравилаПредварительные.Порядок) КАК Порядок
	                      |	ИЗ
	                      |		ВТПравилаПредварительные КАК ВТПравилаПредварительные
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТПравилаПредварительные.Номенклатура,
	                      |		ВТПравилаПредварительные.Характеристика) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПравилаПредварительные КАК ВТПравилаПредварительные
	                      |		ПО ВЗ.Номенклатура = ВТПравилаПредварительные.Номенклатура
	                      |			И ВЗ.Характеристика = ВТПравилаПредварительные.Характеристика
	                      |			И ВЗ.Порядок = ВТПравилаПредварительные.Порядок
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТПравила
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ВТПравилаПредварительные");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	Запрос.УстановитьПараметр("НоменклатураУстановлена", МасНоменклатура.Количество() > 0);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Выполнить();
КонецПроцедуры

Функция СформироватьБазовыеЦены(ДатаСреза) Экспорт
	МВТ = Новый МенеджерВременныхТаблиц;
	ПолучитьАктуальные(МВТ, ДатаСреза);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Период КАК Период,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.ЦенаЕдиницыХранения КАК Цена
	                      |ПОМЕСТИТЬ ВТЦеныПоставщиков
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&ДатаСреза, ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	                      |;
	                      |
						  //|////////////////////////////////////////////////////////////////////////////////
						  //|ВЫБРАТЬ
						  //|	ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
						  //|	ВТЦеныПоставщиков.Характеристика КАК Характеристика,
						  //|	МАКСИМУМ(ВТЦеныПоставщиков.Цена) КАК Цена
						  //|ПОМЕСТИТЬ ВТЦеныПоставщиковПоследние
						  //|ИЗ
						  //|	(ВЫБРАТЬ
						  //|		МАКСИМУМ(ВТЦеныПоставщиков.Период) КАК Период,
						  //|		ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
						  //|		ВТЦеныПоставщиков.Характеристика КАК Характеристика
						  //|	ИЗ
						  //|		ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
						  //|	
						  //|	СГРУППИРОВАТЬ ПО
						  //|		ВТЦеныПоставщиков.Номенклатура,
						  //|		ВТЦеныПоставщиков.Характеристика) КАК ВЗ
						  //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
						  //|		ПО ВЗ.Период = ВТЦеныПоставщиков.Период
						  //|			И ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
						  //|			И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
						  //|
						  //|СГРУППИРОВАТЬ ПО
						  //|	ВТЦеныПоставщиков.Номенклатура,
						  //|	ВТЦеныПоставщиков.Характеристика
						  //|;
	                      |
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |	СУММА(ТоварыВНаличииОстатки.КоличествоОстаток) КАК Количество,
	                      |	СУММА(ТоварыВНаличииОстатки.СуммаОстаток) КАК Сумма
	                      |ПОМЕСТИТЬ ВТОстатки
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии.Остатки(&ДатаСреза, ) КАК ТоварыВНаличииОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВНаличииОстатки.Номенклатура,
	                      |	ТоварыВНаличииОстатки.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.ЗакупочнаяЦена КАК ЗакупочнаяЦена,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.ВидНаценки = ЗНАЧЕНИЕ(Перечисление.ВидыНаценок.Сумма)
	                      |			ТОГДА ВЗ.ОсноваРасчётаСумма + ВЗ.Показатель
	                      |		КОГДА ВЗ.ВидНаценки = ЗНАЧЕНИЕ(Перечисление.ВидыНаценок.Процент)
	                      |			ТОГДА ВЗ.ОсноваРасчётаСумма + ВЗ.ОсноваРасчётаСумма / 100 * ВЗ.Показатель
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЫРАЗИТЬ(ВТПравилаЦенообразования.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |		ВТПравилаЦенообразования.Характеристика КАК Характеристика,
	                      |		ВТПравилаЦенообразования.ВидНаценки КАК ВидНаценки,
	                      |		ВТПравилаЦенообразования.Показатель КАК Показатель,
	                      |		ВТПравилаЦенообразования.ОсноваРасчёта КАК ОсноваРасчёта,
						  |		ВТЦеныПоставщиковПоследние.Цена как ЗакупочнаяЦена,
	                      |		ВЫБОР
	                      |			КОГДА ВТПравилаЦенообразования.ОсноваРасчёта = ЗНАЧЕНИЕ(Перечисление.ОсновыРасчётаНаценок.Себестоимость)
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА ЕСТЬNULL(ВТОстатки.Количество, 0) = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТОстатки.Сумма, 0) / ЕСТЬNULL(ВТОстатки.Количество, 0) + ЕСТЬNULL(ВТОстатки.Сумма, 0) / ЕСТЬNULL(ВТОстатки.Количество, 0) / 100 * ЕСТЬNULL(НадбавкиНаСебестоимостьСрезПоследних.Процент, 0) КАК ЧИСЛО(12, 2))
	                      |					КОНЕЦ
	                      |			КОГДА ВТПравилаЦенообразования.ОсноваРасчёта = ЗНАЧЕНИЕ(Перечисление.ОсновыРасчётаНаценок.ПоследнийПриход)
	                      |				ТОГДА ВЫБОР
	                      |						КОГДА ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) = 0
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) + ЕСТЬNULL(ВТЦеныПоставщиковПоследние.Цена, 0) / 100 * ЕСТЬNULL(НадбавкиНаСебестоимостьСрезПоследних.Процент, 0) КАК ЧИСЛО(12, 2))
	                      |					КОНЕЦ
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ КАК ОсноваРасчётаСумма
	                      |	ИЗ
	                      |		ВТПравилаЦенообразования КАК ВТПравилаЦенообразования
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиНаСебестоимость.СрезПоследних(&ДатаСреза, ) КАК НадбавкиНаСебестоимостьСрезПоследних
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = НадбавкиНаСебестоимостьСрезПоследних.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = НадбавкиНаСебестоимостьСрезПоследних.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиковПоследние
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = ВТЦеныПоставщиковПоследние.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = ВТЦеныПоставщиковПоследние.Характеристика
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	                      |			ПО ВТПравилаЦенообразования.Номенклатура = ВТОстатки.Номенклатура
	                      |				И ВТПравилаЦенообразования.Характеристика = ВТОстатки.Характеристика) КАК ВЗ
						  //|ГДЕ
						  //|	ВЗ.ОсноваРасчётаСумма > 0 
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЗ.Номенклатура.Наименование");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
